<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"4dd038f231dc26aba46cc755ac4bf5ce2b180f06aa579044c36fd19c34540358","plan_job_ref":"Job Test actions using target and replace #491 at https://github.com/dflook/terraform-github-actions/actions/runs/15311246341","plan_out_hash":"f00cce21d9edad09666388a43d6401269f9d11f1f236514dc75ff691f9ba9817","plan_hash":"75272efca974060f987c6b854cb334eecbc2a05c1abbeef97be9cf53786d0a76","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "yJfl13siLf" -> (known after apply)
!~  foreach = "lmt4Sxh19W" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #491](https://github.com/dflook/terraform-github-actions/actions/runs/15311246341)